export const studentResources = {
    title: 'Доєднуйся як студент',
    description: 'Інтерактивно вивчай алгоритми планування, заміщення сторінок та методи уникнення тупикових ситуацій. Занурюйся в ці концепції через практичні завдання та симуляції.',
    options: [
        'Досліджуй алгоритми через інтерактивну матрицю станів процесів',
        'Проходь тести, щоб закріпити знання',
        'Вивчай теоретичні основи алгоритмів операційних систем',
    ],
};

export const teacherResources = {
    title: 'Доєднуйся як викладач',
    description: 'Створюйте інтерактивні завдання для студентів з алгоритмів планування, заміщення сторінок та уникнення тупикових ситуацій.',
    options: [
        'Генеруй завдання з алгоритмів для навчання',
        'Створюй екзаменаційні білети з можливістю завантаження',
        'Використовуй симулятори базових алгоритмів операційних систем для демонстрації',
    ],
};

export const roleResources = {
    student: studentResources,
    teacher: teacherResources,
};